текст = 'сверхсекретное сообщение я'
ключ = 6
алфавит = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']

def Алгоритм(текст, ключ, тип_операции):
    global алфавит
    новый_текст = ''
    for буква in текст:
        if буква == " ":
            новый_текст += " "
            continue
        индекс_в_алфавите = алфавит.index(буква)
        if тип_операции == "зашифровать":
            новый_индекс = индекс_в_алфавите + ключ
        elif тип_операции == "дешифровать":
            новый_индекс = индекс_в_алфавите - ключ
        if новый_индекс >= 33:
            новый_индекс = новый_индекс - 33
        elif новый_индекс < 0:
            новый_индекс = 33 + новый_индекс
        новый_текст += алфавит[новый_индекс]
    return новый_текст

def Шифрователь(открытый_текст, ключ):
    return Алгоритм(открытый_текст, ключ, "зашифровать")

def Дешифрователь(закрытый_текст, ключ): # "фрыаофлрва йшгадфрыова"
    return Алгоритм(закрытый_текст, ключ, "дешифровать")
    
зашифрованная_строка = Шифрователь(текст, ключ)
print('зашифрованная строка:', зашифрованная_строка)
расшифрованная_строка = Дешифрователь(зашифрованная_строка, 6)
print('расшифрованная строка:', расшифрованная_строка)