class Подшипник:
    n = 6
    d = 10

    def __init__(self, n, d, форма):
        self.n = n
        self.d = d
        self.форма = форма

подшипник51 = Подшипник(100500, 5, "Квадратичная")
print(подшипник51.n)

class Живая_дочка_Подшипника(Подшипник):
    __n =10
    d = 15

    def вращаться(self, об_м):
        print(f'подшипница вращается {об_м} раз в минуту')

подшипник_живой3 = Живая_дочка_Подшипника(100500, 5, "Квадратичная")
подшипник_живой3.вращаться(90000)
подшипник_живой3._n = 10
print(подшипник_живой3._n)